# Combining and Merging Data Sets

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
# DB-style dataframe merges
df1 = DataFrame({'key': ['b', 'b','a','c','a','a','b'], 'data1':range(7)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2 = DataFrame({'key': ['a','b','d'], 'data2': range(3)})
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [8]:
# many-to-one merge situation
pd.merge(df1, df2, on='key') #it is a good practice to specify the overlapping column names

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [10]:
#combining 2 dataframes
df3 = DataFrame(np.arange(6).reshape(3,2), index=['a', 'b','c'], columns=['one', 'two'])
df3

   one  two
a    0    1
b    2    3
c    4    5

In [11]:
df4 =  DataFrame(5 + np.arange(4).reshape(2,2), index=['a','c'], columns=['three', 'four'])
pd.concat([df3, df4], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [ ]:
# search python pandas in Twitter
import requests
url = 'http://search.twitter.com/search.json?q=python%20pandas'
resp = requests.get(url)

# then parse the http response
import json
data = json.loads(resp.text)

# create a data frame from the tweets
tweet_fields = ['created_at', 'from_user', 'id', 'text']
tweets = DataFrame(data['results'], columns=tweet_fields)

In [13]:
#reshaping with heirarchical indexing
df = DataFrame(np.arange(6).reshape(2,3),
               index=pd.Index(['a','b'], name='letters'),
               columns=pd.Index(['2016', '2015', '2014'], name='year'))
df

year     2016  2015  2014
letters
a           0     1     2
b           3     4     5

In [16]:
result = df.stack() # 'stack' pivots the columns into rows
result

letters  year
a        2016    0
         2015    1
         2014    2
b        2016    3
         2015    4
         2014    5
dtype: int64

In [17]:
result.unstack()

year     2016  2015  2014
letters
a           0     1     2
b           3     4     5

# Data Transformation

In [19]:
#removing duplicates
df = DataFrame({'a': ['one']*3 + ['two']*4, 'b': [1,1,2,3,3,4,4]})
df

     a  b
0  one  1
1  one  1
2  one  2
3  two  3
4  two  3
5  two  4
6  two  4

In [22]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [23]:
df.drop_duplicates()

     a  b
0  one  1
2  one  2
3  two  3
5  two  4

In [25]:
df['c'] = range(7)
df

     a  b  c
0  one  1  0
1  one  1  1
2  one  2  2
3  two  3  3
4  two  3  4
5  two  4  5
6  two  4  6

In [27]:
df.drop_duplicates(['a'])

     a  b  c
0  one  1  0
3  two  3  3

In [30]:
df.drop_duplicates(['a'], keep='last') #keep option

     a  b  c
2  one  2  2
6  two  4  6

In [31]:
#transforming data using mapping
df = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham',
                       'nova lox'],
               'ounces': [4,3,12,6,7.5,8,3,5,6]}
              )
df

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [33]:
# suppose you want to add a column indicating the type of animal that each food came from
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

df['animal'] = df['food'].map(str.lower).map(meat_to_animal)
df

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
# alternatively,

df['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [36]:
data = Series([1., -999, 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64